{
    "id": "zufinance",
    "symbol": "zuf",
    "name": "ZuFinance",
    "platforms": {
        "binance-smart-chain": "0x400a581c2056463dc573bbbb4b247c6c0769fba6"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "ZuFinance is a DeFi Token issued on Binance Smart Chain (BEP-20), designed to serve the gaming and sports betting industry, with three simple features implemented at its core;\r\n\r\n1. Static Reward (2%)\r\nThe holders will see their wallets growing automatically. Our redistribution structure is based on the percentage of holdings a user has in their wallet. Additionally, the redistribution percentage can be even higher. This happens when sizeable Token-holder accounts make significant transactions. We call this “anti-whale protection.”\r\nIt prevents significant price changes due to massive sell-offs and puts more GAIN Tokens in users’ Wallets with each sale. The purpose of this mechanism is to reduce the pressure to sell the Tokens and relinquish the long-term position, following a price decline caused by early adopters selling their Tokens after reaching a high APY. Also, for the benefit of later adopters, motivating them to take a long-term position.\r\n\r\n2. LP Acquisition (5%) \r\nLP is automatically generated by the function that penalizes each transaction a 10% fee, of which 5% is added as Liquidity on PancakeSwap. The penalty is an arbitrage-proof mechanism that secures the total volume of ZuFinance. The penalty is also used to support the minimum price and increase the overall liquidity of the Token. In short, ZuFinance token price support is a result of the Automatic Liquidity Generation functions. LP function prevents significant price drops that occur when whales choose to sell their Tokens.\r\n\r\n3. Burn on each trade (3%) \r\nEach transaction will be penalized with a fee of 10%, of which 3% will result in the automated burning of Tokens.\r\nThis aspect is beneficial for increasing the price by decreasing the entire supply of Tokens in circulation.\r\n"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x400a581c2056463dc573bbbb4b247c6c0769fba6",
    "url": "https://zufinance.net/",
    "explorers": [
        "https://bscscan.com/token/0x400a581c2056463dc573bbbb4b247c6c0769fba6"
    ],
    "twitter": "ZuFinance",
    "telegram": "ZuFinance",
    "reddit": "ZuFinance_Token/",
    "github_org": "zufinance"
}